src/Reports/ИТ_ПродажиПоРозничномуКлассификатору_ПланФакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>ИТ_ПродажиПоРозничномуКлассификатору_ПланФакт</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/InformationRegisters/ИТ_ПланПродаж_РозничныйКлассификатор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИТ_ПланПродаж_РозничныйКлассификатор</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВыручкаРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВаловаяМаржаРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписаниеРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РозничныйКлассификатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИерархияАльтернативная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>Блок учета продаж товаров и оказания услуг</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество проданного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыручкаБезНДС</Name>
					<Comment>Выручка без НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыручкаДоПримененияСкидки</Name>
					<Comment>Выручка до применения скидки с НДС в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыручкаДоПримененияСкидкиБезНДС</Name>
					<Comment>Выручка до применения скидки в валюте регл. учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Comment>Себестоимость в валюте регл. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСВходящий</Name>
					<Comment>Сумма входящего НДС в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьБезНДС</Name>
					<Comment>Себестоимость в валюте регл. учета без учета налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСУпр</Name>
					<Comment>Сумма НДС в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыручкаБезНДСУпр</Name>
					<Comment>Выручка без НДС в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСкидкиУпр</Name>
					<Comment>Сумма скидки в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыручкаДоПримененияСкидкиУпр</Name>
					<Comment>Выручка до применения скидки с НДС в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыручкаДоПримененияСкидкиБезНДСУпр</Name>
					<Comment>Выручка до применения скидки в валюте управленческого учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьУпр</Name>
					<Comment>Себестоимость в валюте упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСВходящийУпр</Name>
					<Comment>Сумма входящего НДС в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьБезНДСУпр</Name>
					<Comment>Себестоимость в валюте упр. учета без учета налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был зафиксирован факт продажи товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Проданный товар или оказанная услуга</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Поставщик у которого товар был куплен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Покупатель который купил товар или которому была оказана услуга</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей товар мы продали (собственный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов с покупателем</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании с которого товар был продан</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Reports/ИТ_ПродажиПоРозничномуКлассификатору_ПланФакт/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных();
	
	КлючВарианта = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("КлючВарианта", КлючВарианта);
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ВнешниеНаборыДанных = ПолучитьВнешниеНаборыДанных(Настройки);
	
	МакетКомпоновки	= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

Функция ПолучитьВнешниеНаборыДанных(Настройки)
	
	Запрос = Новый Запрос();
	СхемаЗапроса = SSL_IT_СхемыЗапросов.ПолучитьСхемуЗапроса(
		"ВЫБРАТЬ
		|	ИТ_ПланПродаж_РозничныйКлассификатор.Период КАК Период,
		|	ИТ_ПланПродаж_РозничныйКлассификатор.РозничныйКлассификатор КАК РозничныйКлассификатор,
		|	ИТ_ПланПродаж_РозничныйКлассификатор.ВыручкаРуб КАК ВыручкаРуб_План,
		|	ИТ_ПланПродаж_РозничныйКлассификатор.ВыручкаКг КАК ВыручкаКг_План,
		|	ИТ_ПланПродаж_РозничныйКлассификатор.СписаниеРуб КАК СписаниеРуб_План
		|ПОМЕСТИТЬ ПлановыеПоказатели
		|ИЗ
		|	РегистрСведений.ИТ_ПланПродаж_РозничныйКлассификатор КАК ИТ_ПланПродаж_РозничныйКлассификатор
		|ГДЕ
		|	ИТ_ПланПродаж_РозничныйКлассификатор.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОбороты.Период КАК Период,
		|	ПродажиОбороты.Номенклатура.ИТ_РозничныйКлассификатор КАК РозничныйКлассификатор,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиОбороты.Номенклатура.Вес = 0
		|				ТОГДА ПродажиОбороты.КоличествоОборот
		|			ИНАЧЕ ПродажиОбороты.КоличествоОборот * ПродажиОбороты.Номенклатура.Вес
		|		КОНЕЦ) КАК ВыручкаКг_Факт,
		|	СУММА(ПродажиОбороты.СтоимостьОборот) КАК ВыручкаРуб_Факт
		|ПОМЕСТИТЬ ВыручкаФакт
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			День,
		|			ТИПЗНАЧЕНИЯ(ДокументПродажи) В (ТИП(Документ.ОтчетОРозничныхПродажах), ТИП(Документ.ИТ_ВнесениеДанныхПродаж))
		|				И Номенклатура.ИТ_РозничныйКлассификатор В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ПлановыеПоказатели.РозничныйКлассификатор
		|					ИЗ
		|						ПлановыеПоказатели КАК ПлановыеПоказатели)) КАК ПродажиОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиОбороты.Номенклатура.ИТ_РозничныйКлассификатор,
		|	ПродажиОбороты.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыНаСкладахОбороты.Период КАК Период,
		|	ТоварыНаСкладахОбороты.Номенклатура.ИТ_РозничныйКлассификатор КАК РозничныйКлассификатор,
		|	СУММА(-ТоварыНаСкладахОбороты.СуммаОборот) КАК СписаниеРуб_Факт
		|ПОМЕСТИТЬ СписанияФакт
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Обороты(&НачалоПериода, &КонецПериода, День, АналитикаХозяйственнойОперации В (&АналитикиСписанийТоваров)) КАК ТоварыНаСкладахОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНаСкладахОбороты.Номенклатура.ИТ_РозничныйКлассификатор,
		|	ТоварыНаСкладахОбороты.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлановыеПоказатели.Период КАК Период,
		|	ПлановыеПоказатели.РозничныйКлассификатор КАК РозничныйКлассификатор,
		|	ПлановыеПоказатели.ВыручкаРуб_План КАК ВыручкаРуб_План,
		|	ПлановыеПоказатели.ВыручкаКг_План КАК ВыручкаКг_План,
		|	ПлановыеПоказатели.СписаниеРуб_План КАК СписаниеРуб_План,
		|	ВыручкаФакт.ВыручкаКг_Факт КАК ВыручкаКг_Факт,
		|	ВыручкаФакт.ВыручкаРуб_Факт КАК ВыручкаРуб_Факт,
		|	СписанияФакт.СписаниеРуб_Факт КАК СписаниеРуб_Факт
		|ИЗ
		|	ПлановыеПоказатели КАК ПлановыеПоказатели
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВыручкаФакт КАК ВыручкаФакт
		|		ПО ПлановыеПоказатели.Период = ВыручкаФакт.Период
		|			И ПлановыеПоказатели.РозничныйКлассификатор = ВыручкаФакт.РозничныйКлассификатор
		|		ЛЕВОЕ СОЕДИНЕНИЕ СписанияФакт КАК СписанияФакт
		|		ПО ПлановыеПоказатели.Период = СписанияФакт.Период
		|			И ПлановыеПоказатели.РозничныйКлассификатор = СписанияФакт.РозничныйКлассификатор");
	
	// Розничный классификатор
	ЭлементыПользовательскихНастроек = Настройки.ПараметрыДанных.Элементы;
	Элемент_РозничныйКлассификатор = ЭлементыПользовательскихНастроек.Найти("РозничныйКлассификатор");
	
	Если Элемент_РозничныйКлассификатор.Использование Тогда 
		SSL_IT_СхемыЗапросов.ДобавитьУсловие(
			"ИТ_ПланПродаж_РозничныйКлассификатор.РозничныйКлассификатор В(&РозничныйКлассификатор)",,, СхемаЗапроса);
		Запрос.УстановитьПараметр("РозничныйКлассификатор", Элемент_РозничныйКлассификатор.Значение);
	КонецЕсли;	

	// Период
	ПериодОтчета = ЭлементыПользовательскихНастроек.Найти("ПериодОтчета").Значение;
	
	Если ЗначениеЗаполнено(ПериодОтчета.ДатаНачала) Тогда 
		Запрос.УстановитьПараметр("НачалоПериода", ПериодОтчета.ДатаНачала);	
	Иначе	
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущаяДата()));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПериодОтчета.ДатаОкончания) Тогда 
		Запрос.УстановитьПараметр("КонецПериода", ПериодОтчета.ДатаОкончания);	
	Иначе	
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Запрос.Параметры.НачалоПериода));
	КонецЕсли;
	
	// Служебные параметры
	АналитикиСписанийТоваров = Новый Массив();
	АналитикиСписанийТоваров.Добавить(Справочники.АналитикаХозяйственныхОпераций.СписаниеТоваров);
	АналитикиСписанийТоваров.Добавить(Справочники.АналитикаХозяйственныхОпераций.ВозвратПоставщику);
	Запрос.УстановитьПараметр("АналитикиСписанийТоваров", АналитикиСписанийТоваров); 
	
	// Формирование результата
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	Результат = Запрос.Выполнить();
	ВнешниеНаборыДанных = Новый Структура("ПланФакт", Результат.Выгрузить());
	
	// Возврат
	Возврат ВнешниеНаборыДанных;
	
КонецФункции
